//===== FiveM Script =========================================
//= UI - Server Announcements
//===== Developed By: ========================================
//= Azael Dev
//===== Website: =============================================
//= https://www.azael.dev
//===== License: =============================================
//= Copyright (C) Azael Dev - All Rights Reserved
//= You are not allowed to sell this script or edit
//============================================================ 

const command = 'anm';                                      // คำสั่งที่ใช้ในการประกาศสำหรับผู้ดูแลระบบ ใช้คำสั่งได้ผ่าน Chat, F8 หรือ Server Console ใช้ ACE Permissions ในการตรวจสอบสิทธิ์การใช้งานคำสั่ง
const display = 30;                                         // เวลาในการเเสดงข้อความที่ประกาศ (วินาที)
const announceAdmin = 'ผู้ดูแลระบบ';                           // หัวข้อประกาศข้อความจากผู้ดูแลระบบ
const announceAutomate = 'ประกาศ';                          // หัวข้อประกาศข้อความอัตโนมัติ
const enableAutomate = true;                                // เปิดใช้งาน ประกาศข้อความโดยอัตโนมัติหรือไม่? (true เท่ากับเปิดใช้งาน | false เท่ากับ ปิดใช้งาน)
const automateDelay = 5;                                    // ดีเลย์ในการประกาศข้อความโดยอัตโนมัติ (นาที)
const automateLists = [                                     // ข้อความที่ต้องการประกาศโดยอัตโนมัติ
    'ยินดีต้อนรับ ขอให้สนุกกับการสวมบทบาท',
    'ติดตามข่าวสารและกิจกรรมต่างๆ ได้ที่กลุ่มชุมชนของเรา',
    'หากพบผู้กระทำความผิด โปรดแจ้งผู้ดูแลระบบ'
];
